# Вычисление определителя двумя методами
from random import randint

# Функция вывода на печать
def print_matr(A):
    print("\nМатрица A\n")
    for i in range(3):
            for j in range(3):
                print(A[i][j],end=" ")
            print()
# Функция вычисления     
def print_det(A):
    print("\n---------------------------")
    print("Метод треугольников\n")
    print(A[0][0],"x",A[1][1],"x",A[2][2]," + ",A[0][1],"x",A[1][2],
          "x",A[2][0]," + ",A[0][2],"x",A[1][0],"x",A[2][1]," - ",
          A[0][2],"x",A[1][1],"x",A[2][0]," - ",A[0][1],"x",A[1][0],
          "x",A[2][2]," - ",A[0][0],"x",A[1][2],"x",A[2][1] )

    print("\nОпределитель A равен: ",A[0][0]*A[1][1]*A[2][2]+A[0][1]*A[1][2]*
          A[2][0]+A[0][2]*A[1][0]*A[2][1]-
          A[0][2]*A[1][1]*A[2][0]-A[0][1]*A[1][0]*A[2][2]-
          A[0][0]*A[1][2]*A[2][1])
    
    print("\n---------------------------")
    print("Метод миноров\n")
    print("   ",A[1][1]," ",A[1][2],"      ",A[1][0]," ",A[1][2],
          "      ",A[1][0]," ",A[1][1])
    print(A[0][0],"x       - ",A[0][1],"x       + ",A[0][2],"x")
    print("   ",A[2][1]," ",A[2][2],"      ",A[2][0]," ",A[2][2],
          "      ",A[2][0]," ",A[2][1])

    
    
    print("\nОпределитель A равен: ",
          A[0][0]*(A[1][1]*A[2][2]-A[1][2]*A[2][1])-
          A[0][1]*(A[1][0]*A[2][2]-A[1][2]*A[2][0])+
          A[0][2]*(A[1][0]*A[2][1]-A[1][1]*A[2][0]))

  
# формирование матрицы 3 х 3
matr_A=[[randint(1,9) for j in range(3)] for i in range(3)] 
print_matr(matr_A)
print_det(matr_A)                  

